tutorials/multiphase/compressibleInterFoam/laminar/depthCharge3D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
cp -r 0.org 0
runApplication setFields
runApplication decomposePar
runParallel $(getApplication) 4
runApplication reconstructPar

# ----------------------------------------------------------------- end-of-file
